app/views/share/_hot_news.html.erb

      <li style="padding-left: 110px"><span class="label label-danger">热门新帖</span></li>
      <% Topic.order('created_at desc').limit(4).each do |item| %>
---
SELECT "topics".* FROM "topics" ORDER BY created_at desc LIMIT 4

      <li style="text-align: center"><span class="label label-success">火热直播</span></li>
      <% GameLive.order('attention desc').limit(3).each do |item| %>
---
SELECT "game_lives".* FROM "game_lives" ORDER BY attention desc LIMIT 3

      <li style="text-align: center"><span class="label label-important">捧腹糗事</span></li>
      <% Embarrass.order('chan_count desc').limit(4).each do |item| %>
---
SELECT COUNT(*) FROM "embarrasses"