app/views/share/_site_carousel.html.erb

    <div class="item active">
      <% live_carousel =GameLive.order('attention desc').limit(1).first%>
---
SELECT "game_lives".* FROM "game_lives" ORDER BY attention desc LIMIT 1