app/views/users/info_center.html.erb

SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = 1
SELECT COUNT(*) FROM "topics" WHERE "topics"."user_id" = 1
---
            <div><%= Topic.word_count(current_user.id) %></div>
            <span class="notification"><%= Topic.where(:user_id => current_user.id).count %></span>

SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."user_id" = 1
SELECT COUNT(*) FROM "embarrasses" WHERE "embarrasses"."user_id" = 1
---
            <div><%= Embarrass.word_count(current_user.id) %></div>
            <span class="notification green"><%= Embarrass.where(:user_id => current_user.id).count %></span>

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = 1
---
            <div><%= Note.word_count(current_user.id) %></div>
            <span class="notification yellow"><%= Note.where(:user_id => current_user.id).count %></span>

SELECT "relax_moments".* FROM "relax_moments" ORDER BY relax_time desc LIMIT 2
---
<div class="row-fluid sortable"><div></div>
  <% RelaxMoment.order('relax_time desc').limit(2).each do |item| %>

SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = 1 ORDER BY created_at desc LIMIT 2
---
<div class="row-fluid sortable"><div></div>
  <% Topic.where(:user_id => current_user.id).order('created_at desc').limit(2).each do |item| %>

SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."user_id" = 1 ORDER BY chan_count desc LIMIT 3
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "embarrasses" WHERE "embarrasses"."user_id" = 1 LIMIT 3) subquery_for_count
---

  <% Embarrass.where(:user_id => current_user.id).order('chan_count desc').limit(2).each do |item| %>

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 ORDER BY note_date desc LIMIT 3
---
<!-- 个人笔记 start-->
  <% Note.where(:user_id => current_user.id).order('note_date desc').limit(2).each do |item| %>