app/views/game_lives/show.html.erb

          <% end %>
          <a class="user ui-link" title="<%= User.find_by_id(item.user_id).account %>" href="/user?account=<%= User.find_by_id(item.user_id).account %>">
            <img class="img-responsive avatar_" src="<%= User.find_by_id(item.user_id).avatar || Admin::AVATAR[rand(13)] %>" width="44" height="44" alt="">
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT 1