app/views/embarrasses/index.html.erb

SELECT COUNT(*) FROM "embarrass_comments" WHERE "embarrass_comments"."embarrass_id" = 1
---
                    <div class="center">
                      <a href="/embarrasses/<%= item.id %>#comment" class="btn btn-large btn-info"><i class="icon-comment"></i><span style="margin: 0px 15px"><%= EmbarrassComment.where(:embarrass_id=>item.id).count %></span></a>