app/views/embarrasses/show.html.erb

  <div style="padding-top: 15px">
    <% if Embarrass.find_by_id(@embarrass.id-1).present? %>
---
SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."id" = $1 LIMIT 1  [["id", "1"]]

          <% end %>
          <a class="user ui-link" title="<%= User.find_by_id(item.user_id).account %>" href="/user?account=<%= User.find_by_id(item.user_id).account %>">
            <img class="img-responsive avatar_" src="<%= User.find_by_id(item.user_id).avatar || Admin::AVATAR[rand(13)] %>" width="44" height="44" alt="">
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 LIMIT 1