app/views/home/index.html.erb

SELECT "users".* FROM "users"
---
                    <div>登录总数：<%= User.login_count %></div>
                    <span class="notification"><%= User.all.count %></span>

SELECT "topics".* FROM "topics"
---
                    <div>内容统计：<%= Topic.word_total %></div>
                    <span class="notification green"><%= Topic.all.count %></span>

SELECT "relax_moments".* FROM "relax_moments"
---
                    <div>评论量：<%= RelaxMoment.chan_comment %></div>
                    <span class="notification yellow"><%= RelaxMoment.all.count %></span>

SELECT "embarrasses".* FROM "embarrasses"
---
                    <div>被点赞:<%= Embarrass.chan_count %></div>
                    <span class="notification red"><%= Embarrass.all.count %></span>