app/views/user_sets/my_embarrass.html.erb

                  <div style="float: left">
                    <a href="/qiushibaike/<%= item.id.to_s.encode %>#comment" class="btn btn-large btn-info"><i class="icon-comment"></i><span style="margin: 0px 15px"><%= EmbarrassComment.where(:embarrass_id=>item.id).count %></span></a>
---
SELECT COUNT(*) FROM "embarrass_comments" WHERE "embarrass_comments"."embarrass_id" = 2