app/views/site/index.html.erb

SELECT "topics".* FROM "topics" ORDER BY id desc LIMIT 3
---
      <div class="row">
        <% Topic.order('id desc').limit(3).each do |item| %>

SELECT "relax_moments".* FROM "relax_moments" ORDER BY relax_time DESC LIMIT 10
---
              <param name="movie" value="/player/dewplayer-vinyl.swf" />
              <param name="flashvars" value="xml=/player/dewplay.xml&mp3=
            <% RelaxMoment.order('relax_time DESC').limit(10).each do |item| %>

SELECT "embarrasses".* FROM "embarrasses" ORDER BY chan_count desc LIMIT 2
---
    <div class="row-fluid sortable"><div></div>
        <% Embarrass.order('chan_count desc').limit(2).each do |item| %>