app/views/site/rorshow.html.erb

          <span  style="font-size: 25px;background-color: #000000;font-weight: bolder;color: white">&nbsp;&nbsp;<%= @topic.topic_title%></span><br>
          <span class="label label-important" style="font-size: 20px"><i class="icon-heart"></i> <%= User.find_by_id(@topic.user_id).account %></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

    <div style="padding-top: 15px">
      <% if Topic.find_by_id(@topic.id-1).present? %>
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = 5 LIMIT 1

            <a class="user ui-link" title="<%= User.find_by_id(item.user_id).account %>" href="/user?account=<%= User.find_by_id(item.user_id).account %>">
              <img class="img-responsive avatar_" src="<%= User.find_by_id(item.user_id).avatar || Admin::AVATAR[rand(13)] %>" width="44" height="44" alt="">
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT 1


    $('#submit').click(function(){
        params = {};
        params['topic_comment'] = {};
        params['topic_comment']['topic_id'] = <%= @topic.id %>;
        params['topic_comment']['user_id'] = <%= current_id  %>;
        params['topic_comment']['comment'] = $('#discuss').val();
        if(params['topic_comment']['user_id']==0) {
            alert('您没有登录,无法评论');
            $('#discuss').val('');
            return false;
        }
        if(params['topic_comment']['comment'].trim()==''){
            alert('请至少说点什么吧！');
            return false;
        }else{
            $.post('/topic_comments', params,function(data){
                if(data.status == 200){
                    var new_comment = '';
                    new_comment +='<li class="chat-right">';
                    new_comment +='<a class="user ui-link">';
                    new_comment +='<img width="44" height="44" alt="" class="img-responsive avatar_" src='+ '<% if @current_user.present? %><%= @current_user.avatar || Admin::AVATAR[rand(13)] %><% end %>' + '>';
---
SELECT "topic_comments".* FROM "topic_comments" WHERE "topic_comments"."topic_id" = 5