app/views/site/rubyonrails.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
            <div class="box-header well" data-original-title>
              <span class="label label-important" style="font-size: 20px"><i class="icon-heart"></i> <%= User.find_by_id(item.user_id).account %></span>

SELECT "topics".* FROM "topics" ORDER BY updated_at desc LIMIT 1 OFFSET 0
---
              <span class="label label-warning" style="font-size: 20px"><i class="icon-flag"></i> </id><%= item.topic_type %></span><br>
              <% if item.topic_tag.present? %>