app/views/site/yxzbshow.html.erb

                <% end %>
                <a class="user ui-link" title="<%= User.find_by_id(item.user_id).account %>" href="/user?account=<%= User.find_by_id(item.user_id).account %>">
                  <img class="img-responsive avatar_" src="<%= User.find_by_id(item.user_id).avatar || Admin::AVATAR[rand(13)] %>" width="44" height="44" alt="">
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."id" IS NULL LIMIT 1


    $('#submit').click(function(){
        params = {};
        params['game_comment'] = {};
        params['game_comment']['game_id'] = <%= @game_life.id %>;
        params['game_comment']['user_id'] = <%= current_id  %>;
        params['game_comment']['comment'] = $('#discuss').val();
        if(params['game_comment']['user_id']==0) {
            alert('您没有登录,无法评论');
            $('#discuss').val('');
            return false;
        }
        if(params['game_comment']['comment'].trim()==''){
            alert('请至少说点什么吧！');
            return false;
        }else{
            $.post('/game_comments', params,function(data){
                if(data.status == 200){
                    var new_comment = '';
                    new_comment +='<li class="chat-right">';
                    new_comment +='<a class="user ui-link">';
                    new_comment +='<img width="44" height="44" alt="" class="img-responsive avatar_" src='+ '<% if @current_user.present? %><%= @current_user.avatar || Admin::AVATAR[rand(13)] %><% end %>' + '>';
---
SELECT "game_comments".* FROM "game_comments" WHERE "game_comments"."game_id" = 2