app/controllers/embarrasses_controller.rb

  def index
    @embarrasses = Embarrass.order('chan_count DESC').order('created_at desc').paginate(:page=>params[:page], :per_page=>6)
---
SELECT "embarrasses".* FROM "embarrasses" ORDER BY chan_count DESC, created_at desc LIMIT 6 OFFSET 0

  def show
    @embarrass = Embarrass.find(params[:id])
---
SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."id" = $1 LIMIT 1  [["id", "1"]]

  def applaud

    if Embarrass.find_by_id(params[:id]).present?
      @embarrass = Embarrass.find_by_id(params[:id])
      @embarrass.chan_count = @embarrass.chan_count + 1
      @embarrass.save
---
SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."id" = 5 LIMIT 1
UPDATE "embarrasses" SET "chan_count" = 6, "updated_at" = '2014-12-20 06:15:58.159385' WHERE "embarrasses"."id" = 5