app/controllers/embarrass_comments_controller.rb

  def create
    @embarrass_comment = EmbarrassComment.new(params[:embarrass_comment])
    if @embarrass_comment.save
---
INSERT INTO "embarrass_comments" ("comment", "created_at", "embarrass_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "简单原理，却透露着人类多少年智慧的结晶！"], ["created_at", Sat, 20 Dec 2014 06:39:56 UTC +00:00], ["embarrass_id", 8], ["updated_at", Sat, 20 Dec 2014 06:39:56 UTC +00:00], ["user_id", 1]]