app/controllers/game_lives_controller.rb

  def index

    @game_lives = GameLive.order('attention desc').paginate(:page=> params[:page],:per_page=> 3)
---
SELECT "game_lives".* FROM "game_lives" ORDER BY attention desc LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "game_lives"

  def show

    @game_life = GameLive.find(params[:id])
---
SELECT "game_lives".* FROM "game_lives" WHERE "game_lives"."id" = $1 LIMIT 1  [["id", "2"]]