app/controllers/game_comments_controller.rb

  def create
    @game_comment = GameComment.new(params[:game_comment])
    if @game_comment.save
---
INSERT INTO "game_comments" ("comment", "created_at", "game_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "小智，我要给你生孩子~"], ["created_at", Tue, 23 Dec 2014 07:48:20 UTC +00:00], ["game_id", 2], ["updated_at", Tue, 23 Dec 2014 07:48:20 UTC +00:00], ["user_id", 10]]