app/controllers/relax_moments_controller.rb

  def index

    @relax_moments = RelaxMoment.order('chan_count DESC').order('relax_time desc').paginate(:page=>params[:page], :per_page=>6)
---
SELECT "relax_moments".* FROM "relax_moments" ORDER BY chan_count DESC, relax_time desc LIMIT 6 OFFSET 0