app/controllers/relax_comments_controller.rb

  def create

    @relax_comment = RelaxComment.new(params[:relax_comment])
    if @relax_comment.save
---
INSERT INTO "relax_comments" ("comment", "created_at", "relax_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "虽然是被冻成了狗，但是每天仍然坚持看轻松一刻~"], ["created_at", Tue, 23 Dec 2014 08:29:07 UTC +00:00], ["relax_id", 1], ["updated_at", Tue, 23 Dec 2014 08:29:07 UTC +00:00], ["user_id", 10]]