app/controllers/sessions_controller.rb

  def admin_login #登录

    if params[:account].blank? && params[:password].blank?
      flash[:error] = '账号密码不能为空'
      redirect_to admin_sign_in_path
    elsif params[:account].blank?
      flash[:error] = '账号不能为空'
      redirect_to admin_sign_in_path
    elsif params[:password].blank?
      flash[:error] = '密码不能为空'
      redirect_to admin_sign_in_path
    elsif Admin.find_by_account(params[:account]).nil?
      flash[:error] = '账号不存在'
      redirect_to admin_sign_in_path
    else
      @current_admin = Admin.find_by_account(params[:account])
      if @current_admin.password == Digest::MD5.hexdigest(params[:password])
        @current_admin.login_count = @current_admin.login_count + 1
        @current_admin.login_ip = request.remote_ip
        @current_admin.save
---
SELECT "admins".* FROM "admins" WHERE "admins"."account" = 'meteor21475' LIMIT 1
UPDATE "admins" SET "login_count" = 41, "updated_at" = '2014-12-23 08:11:24.237698' WHERE "admins"."id" = 3

  def user_login

    if params[:account].blank? && params[:password].blank?
      flash[:error] = '账号密码不能为空'
      redirect_to action: 'user_sign_in'
    elsif params[:account].blank?
      flash[:error] = '账号不能为空'
      redirect_to action: 'user_sign_in'
    elsif params[:password].blank?
      flash[:error] = '密码不能为空'
      redirect_to action: 'user_sign_in', :account=>params[:account]
    elsif User.find_by_account(params[:account]).nil?
      flash[:error] = '账号不存在'
      redirect_to action: 'user_sign_in'
    else
      @current_user = User.find_by_account(params[:account])
      if @current_user.password == Digest::MD5.hexdigest(params[:password])
        @current_user.login_times = @current_user.login_times + 1
        @current_user.integration = @current_user.integration + 1  #登录一次积分加1
        @current_user.login_ip = request.remote_ip
        @current_user.save
---
SELECT "users".* FROM "users" WHERE "users"."account" = 'Meteor21475' LIMIT 1
UPDATE "users" SET "login_times" = 5, "integration" = 18, "updated_at" = '2014-12-20 05:33:40.433235' WHERE "users"."id" = 1