app/controllers/site_controller.rb

SELECT "topics".* FROM "topics" ORDER BY updated_at desc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "topics"
---
  def rubyonrails

    @topics = Topic.order('updated_at desc').paginate(:page=> params[:page],:per_page=> 6)

SELECT "topics".* FROM "topics" WHERE "topics"."id" = 5 LIMIT 1
SELECT "topic_comments".* FROM "topic_comments" WHERE "topic_comments"."topic_id" = 5
---
  def rorshow
    if Topic.find_by_id(params[:id]).nil?
      flash[:error] = '该贴被城管打死或被作者删除！'
      redirect_to rubyonrails_path
    else
      @topic = Topic.find(params[:id])
      @topic_comment = TopicComment.where(:topic_id => params[:id])

SELECT "relax_moments".* FROM "relax_moments" ORDER BY chan_count DESC, relax_time desc LIMIT 6 OFFSET 0
---
  def qingsongyike

    @relax_moments = RelaxMoment.order('chan_count DESC').order('relax_time desc').paginate(:page=>params[:page], :per_page=>6)

SELECT "relax_moments".* FROM "relax_moments" WHERE "relax_moments"."id" = 1 LIMIT 1
SELECT "relax_comments".* FROM "relax_comments" WHERE "relax_comments"."relax_id" = 1
---
  def qsykshow

    if RelaxMoment.find_by_id(params[:id]).nil?
      flash[:alert] = '网易的编辑中了500万大奖而辞职不干了！'
      redirect_to qingsongyike_path
    else
      @relax_moment = RelaxMoment.find(params[:id])
      @relax_comment = RelaxComment.where(:relax_id => params[:id])

SELECT "embarrasses".* FROM "embarrasses" ORDER BY chan_count DESC, created_at desc LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "embarrasses"
---
  def qiushibaike

    @embarrasses = Embarrass.order('chan_count DESC').order('created_at desc').paginate(:page=>params[:page], :per_page=>6)

SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."id" = 8 LIMIT 1
SELECT "embarrass_comments".* FROM "embarrass_comments" WHERE "embarrass_comments"."embarrass_id" = 8
---
  def qsbkshow

    if Embarrass.find_by_id(params[:id]).nil?
      flash[:success] = '该糗事因为太搞笑被外星人抓走了！'
      redirect_to qiushibaike_path
    else
      @embarrass = Embarrass.find(params[:id])
      @embarrass_comment = EmbarrassComment.where(:embarrass_id => params[:id])

SELECT "game_lives".* FROM "game_lives" ORDER BY attention desc LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "game_lives"
---
  def youxizhibo

    @game_lives = GameLive.order('attention desc').paginate(:page=> params[:page],:per_page=> 4)

SELECT "game_lives".* FROM "game_lives" WHERE "game_lives"."id" = 2 LIMIT 1
SELECT "game_comments".* FROM "game_comments" WHERE "game_comments"."game_id" = 2
---
  def yxzbshow

    if GameLive.find_by_id(params[:id]).nil?
      flash[:notice] = '该主播因嫖娼被抓或被城管打断了小弟弟！'
      redirect_to youxizhibo_path
    else
      @game_life = GameLive.find(params[:id])
      @game_comment = GameComment.where(:game_id => params[:id])

SELECT "users".* FROM "users" WHERE "users"."account" = 'Meteor214' LIMIT 1
---
  def account  #用户名片

      if User.find_by_account(params[:account])