app/controllers/topics_controller.rb

  def index

    @topics = Topic.order('updated_at desc').paginate(:page=> params[:page],:per_page=> 6)
---
SELECT "topics".* FROM "topics" ORDER BY updated_at desc LIMIT 6 OFFSET 0