app/controllers/users_controller.rb

  def get_code

    if User.find_by_phone(params[:phone])
      code = User.six_number
      user = User.find_by_phone(params[:phone])
      if user.verify_time.present? && user.verify_time > Time.now
        @stat= 666
        @msg = '验证码有效时间未过期
请查看手机短信内容'
      else
        user.verify_code = code
        user.verify_time = 1.days.from_now
        user.save
---
SELECT "users".* FROM "users" WHERE "users"."phone" = '18211109527' LIMIT 1
UPDATE "users" SET "verify_code" = '058197', "verify_time" = '2014-12-22 13:24:45.446213', "updated_at" = '2014-12-21 13:24:45.447213' WHERE "users"."id" = 1

  def verify_password_code

    if params[:phone].blank? || params[:code].blank?
      flash[:error] = '手机号验证码不能为空'
      redirect_to action: 'forget_password'
    else
      if User.find_by_phone(params[:phone])
---
SELECT "users".* FROM "users" WHERE "users"."phone" = '18211109527' LIMIT 1

  def reset_password  #重置密码 页面

    if User.find_by_id(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def password_reset  #密码重置   方法

      user = User.find_by_id(params[:user_id])
      user.password = Digest::MD5.hexdigest(params[:password])
      user.verify_code = nil
      user.verify_time = nil
      user.login_times = user.login_times + 1
      user.login_ip = request.remote_ip
      user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "password" = '5416d7cd6ef195a0f7622a9c56b55e84', "verify_code" = NULL, "verify_time" = NULL, "login_times" = 13, "updated_at" = '2014-12-21 13:26:12.838211' WHERE "users"."id" = 1