app/controllers/user_sets_controller.rb

  def edit_topic #get

    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "8"]]

  def update_user_topic  #post
    @topic = Topic.find(params[:topic][:id])
    @topic.update_attributes(params[:topic])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "topics" SET "topic_tag" = '---

  def create_note #post
    params[:note][:user_id] = session[:user_id]
    @note = Note.new(params[:note])
    @note.save
    @current_user.integration = @current_user.integration + 3
    @current_user.save
---
INSERT INTO "notes" ("created_at", "note_content", "note_date", "note_tag", "note_title", "note_weather", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "users" SET "integration" = 28, "updated_at" = '2014-12-21 11:44:27.193988' WHERE "users"."id" = 1

  def edit_note #get
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", "1"]]

  def update_note  #post

    @note = Note.find(params[:note][:id])
    @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "notes" SET "note_title" = '明天的面试', "note_content" = '妈蛋的，连地址都不告诉，我跟你什么仇，什么怨！把我忽悠到了这里，讨厌了啦啦~', "updated_at" = '2014-12-21 13:33:54.766632' WHERE "notes"."id" = 1

  def my_embarrass

    @embarrasses = Embarrass.where(:user_id => session[:user_id]).order('chan_count desc').paginate(:page=> params[:page],:per_page=> 2)
---
SELECT "embarrasses".* FROM "embarrasses" WHERE "embarrasses"."user_id" = 1 ORDER BY chan_count desc LIMIT 2 OFFSET 0

  def my_note
    @note = Note.where(:user_id => session[:user_id]).order('note_date desc').paginate(:page=> params[:page],:per_page=> 14)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 10 ORDER BY note_date desc LIMIT 14 OFFSET 0

  def my_topic

    @topics = Topic.where(:user_id => session[:user_id]).order('updated_at desc').paginate(:page=> params[:page],:per_page=> 2)
---
SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = 1 ORDER BY updated_at desc LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "topics" WHERE "topics"."user_id" = 1

  def delete_topic

    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 1]]